artillery.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 20
scenarios:
  - flow:
      - get:
          url: "/api/pipeline/analytics/overview"
      - get:
          url: "/api/contacts?page=1&limit=10"
      - post:
          url: "/api/integrations/zapier"
          json:
            event: "test"
            data: "sample"